siade/app/templates/cnaf_quotient_familial_request.xml.erb

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://v1.ws.wsdemandedocumentcafweb.cnaf/">
<soap:Header/>
<soap:Body>
  <tns:demanderDocumentWeb xmlns:tns="http://v1.ws.wsdemandedocumentcafweb.cnaf/">
		<arg0>
				<app>WDD</app>
				<id>?</id>
				<beanEntreeDemandeDocumentWeb>
			      <codeAppli>WDD</codeAppli>
            <matricule><%= beneficiary_number %></matricule>
            <codePostal><%= postal_code %></codePostal>
			      <typeDocument>4</typeDocument>
			      <typeEnvoi>5</typeEnvoi>
				</beanEntreeDemandeDocumentWeb>
		</arg0>
  </tns:demanderDocumentWeb>
</soap:Body>
</soap:Envelope>
